blog/2017/02/07/vim/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>vim - org-page</title>
  <meta charset="utf-8" />
  <meta name="author" content="latpaw" />
  <meta name="description" content="&lt;TODO: insert your description here&gt;" />
  <meta name="keywords" content="&lt;TODO: insert your keywords here&gt;" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">
</head>

  <body class="container">
<header id="header">
<body>
    <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
        <div class="container-fluid">
<div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">org-page</a>
        </div>
<div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav navbar-nav navbar-right">
                <li class="active"><a href="/Blog">Blog</a></li>
          <li><a href="https://github.com/latpaw">GitHub</a></li>
        </ul>
</div>
</div>
    </nav>
</body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row" style="padding-top: 70px">
        <div class="col-md-2"></div>
            <h1>vim</h1>
            <div id="outline-container-org1013e2d" class="outline-2">
<h2 id="org1013e2d">VIM</h2>
<div class="outline-text-2" id="text-org1013e2d">
</div><div id="outline-container-org963c849" class="outline-4">
<h4 id="org963c849">toyamarinyon/vim-swift</h4>
</div>
<div id="outline-container-org01fc358" class="outline-4">
<h4 id="org01fc358">Valloric/YouCompleteMe</h4>
</div>
<div id="outline-container-org7fd32d5" class="outline-4">
<h4 id="org7fd32d5">airblade/vim-gitgutter</h4>
</div>
<div id="outline-container-orge7d4ca1" class="outline-4">
<h4 id="orge7d4ca1">ternjs/tern_for_vim</h4>
</div>
<div id="outline-container-org4328bb2" class="outline-4">
<h4 id="org4328bb2">mattn/webapi-vim</h4>
</div>
<div id="outline-container-org5f300ad" class="outline-4">
<h4 id="org5f300ad">mattn/gist-vim</h4>
</div>
<div id="outline-container-orgdf0f793" class="outline-4">
<h4 id="orgdf0f793">vim-scripts/comments.vim</h4>
</div>
<div id="outline-container-org4c78b0c" class="outline-4">
<h4 id="org4c78b0c">kien/ctrlp.vim</h4>
</div>
<div id="outline-container-org2b9e148" class="outline-4">
<h4 id="org2b9e148">sass/sass</h4>
</div>
<div id="outline-container-org94da2c0" class="outline-4">
<h4 id="org94da2c0">sickill/vim-monokai</h4>
</div>

<div id="outline-container-orgc7214c2" class="outline-4">
<h4 id="orgc7214c2">mileszs/ack.vim</h4>
</div>
<div id="outline-container-orgcc41cf2" class="outline-4">
<h4 id="orgcc41cf2">a.vim</h4>
</div>
<div id="outline-container-org4cd8ff3" class="outline-4">
<h4 id="org4cd8ff3">easymotion/vim-easymotion</h4>
</div>
<div id="outline-container-org63919ed" class="outline-4">
<h4 id="org63919ed">Vundle.vim</h4>
</div>

<div id="outline-container-org48bc4d1" class="outline-4">
<h4 id="org48bc4d1">confluencewiki.vim</h4>
</div>
<div id="outline-container-org456de46" class="outline-4">
<h4 id="org456de46">othree/html5.vim</h4>
</div>
<div id="outline-container-orga24a13e" class="outline-4">
<h4 id="orga24a13e">JavaScript-syntax</h4>
</div>
<div id="outline-container-orga29da36" class="outline-4">
<h4 id="orga29da36">mako.vim</h4>
</div>
<div id="outline-container-org4e1c5a0" class="outline-4">
<h4 id="org4e1c5a0">moin.vim</h4>
</div>
<div id="outline-container-org760f05c" class="outline-4">
<h4 id="org760f05c">python.vim--Vasiliev</h4>
</div>
<div id="outline-container-org7c2cf35" class="outline-4">
<h4 id="org7c2cf35">xml.vim</h4>
</div>
<div id="outline-container-org78fd151" class="outline-4">
<h4 id="org78fd151">less</h4>
</div>
<div id="outline-container-org6183a79" class="outline-4">
<h4 id="org6183a79">hallison/vim-markdown</h4>
</div>
<div id="outline-container-orgc1960f7" class="outline-4">
<h4 id="orgc1960f7">tpope/vim-markdown</h4>
</div>
<div id="outline-container-orgc050d3e" class="outline-4">
<h4 id="orgc050d3e">wikipedia.vim</h4>
</div>
<div id="outline-container-org5b6e240" class="outline-4">
<h4 id="org5b6e240">derekwyatt/vim-scala</h4>
</div>
<div id="outline-container-org15ad79c" class="outline-4">
<h4 id="org15ad79c">alswl/play2vim</h4>
</div>
<div id="outline-container-orgc93aeb5" class="outline-4">
<h4 id="orgc93aeb5">tpope/vim-haml</h4>
</div>
<div id="outline-container-org8c8f1a9" class="outline-4">
<h4 id="org8c8f1a9">kchmck/vim-coffee-script</h4>
</div>
<div id="outline-container-org0e3efa7" class="outline-4">
<h4 id="org0e3efa7">vim-ruby/vim-ruby</h4>
</div>
<div id="outline-container-org1c54a89" class="outline-4">
<h4 id="org1c54a89">django.vim</h4>
</div>
<div id="outline-container-orgb16b057" class="outline-4">
<h4 id="orgb16b057">nginx.vim</h4>
</div>

<div id="outline-container-org88a46dd" class="outline-4">
<h4 id="org88a46dd">Impact</h4>
</div>
<div id="outline-container-orgf6b7b61" class="outline-4">
<h4 id="orgf6b7b61">matrix.vim</h4>
</div>
<div id="outline-container-orgd94f982" class="outline-4">
<h4 id="orgd94f982">vividchalk.vim</h4>
</div>
<div id="outline-container-orgc4bc9f5" class="outline-4">
<h4 id="orgc4bc9f5">ego.vim</h4>
</div>
<div id="outline-container-org89d1b5d" class="outline-4">
<h4 id="org89d1b5d">tomasr/molokai</h4>
</div>
<div id="outline-container-orgfc9c153" class="outline-4">
<h4 id="orgfc9c153">altercation/vim-colors-solarized</h4>
</div>

<div id="outline-container-org933e700" class="outline-4">
<h4 id="org933e700">html.vim</h4>
</div>
<div id="outline-container-org7ecc5b1" class="outline-4">
<h4 id="org7ecc5b1">IndentAnything</h4>
</div>
<div id="outline-container-orgeb1204f" class="outline-4">
<h4 id="orgeb1204f">Javascript-Indentation</h4>
</div>
<div id="outline-container-org54d261a" class="outline-4">
<h4 id="org54d261a">mako.vim--Torborg</h4>
</div>
<div id="outline-container-org8b68dc3" class="outline-4">
<h4 id="org8b68dc3">gg/python.vim</h4>
</div>
<div id="outline-container-org131f584" class="outline-4">
<h4 id="org131f584">-NERD-tree</h4>
</div>
<div id="outline-container-org6c8fc3d" class="outline-4">
<h4 id="org6c8fc3d">AutoClose--Alves</h4>
</div>
<div id="outline-container-orgd832861" class="outline-4">
<h4 id="orgd832861">auto_mkdir</h4>
</div>

<div id="outline-container-orgecd4b0d" class="outline-4">
<h4 id="orgecd4b0d">fcitx.vim</h4>
</div>
<div id="outline-container-org765b612" class="outline-4">
<h4 id="org765b612">FencView.vim</h4>
</div>
<div id="outline-container-org299766b" class="outline-4">
<h4 id="org299766b">FuzzyFinder</h4>
</div>
<div id="outline-container-orge238b2b" class="outline-4">
<h4 id="orge238b2b">jsbeautify</h4>
</div>
<div id="outline-container-orgd923098" class="outline-4">
<h4 id="orgd923098">L9</h4>
</div>
<div id="outline-container-org870641b" class="outline-4">
<h4 id="org870641b">Mark</h4>
</div>
<div id="outline-container-org223c9cc" class="outline-4">
<h4 id="org223c9cc">matrix.vim</h4>
</div>
<div id="outline-container-org1b03f9b" class="outline-4">
<h4 id="org1b03f9b">mru.vim</h4>
</div>
<div id="outline-container-org6c7c24d" class="outline-4">
<h4 id="org6c7c24d">The-NERD-Commenter</h4>
</div>
<div id="outline-container-org00476a2" class="outline-4">
<h4 id="org00476a2">restart.vim</h4>
</div>
<div id="outline-container-org0157d8f" class="outline-4">
<h4 id="org0157d8f">taglist.vim</h4>
</div>
<div id="outline-container-org1f0562e" class="outline-4">
<h4 id="org1f0562e">templates.vim</h4>
</div>
<div id="outline-container-org7273158" class="outline-4">
<h4 id="org7273158">vimim.vim</h4>
</div>
<div id="outline-container-org81a03a5" class="outline-4">
<h4 id="org81a03a5">ZenCoding.vim</h4>
</div>
<div id="outline-container-orge5782d6" class="outline-4">
<h4 id="orge5782d6">mattn/emmet-vim</h4>
</div>
<div id="outline-container-org3f0821c" class="outline-4">
<h4 id="org3f0821c">css_color.vim</h4>
</div>
<div id="outline-container-org437a018" class="outline-4">
<h4 id="org437a018">hallettj/jslint.vim</h4>
</div>
<div id="outline-container-orgb4d7a11" class="outline-4">
<h4 id="orgb4d7a11">vcscommand.vim</h4>
</div>
<div id="outline-container-orgcc34940" class="outline-4">
<h4 id="orgcc34940">snipMate</h4>
</div>
<div id="outline-container-orgaf5acd4" class="outline-4">
<h4 id="orgaf5acd4">sirver/ultisnips</h4>
</div>
<div id="outline-container-orge5dafd2" class="outline-4">
<h4 id="orge5dafd2">TaskList.vim</h4>
</div>

<div id="outline-container-org764329d" class="outline-4">
<h4 id="org764329d">git://github.com/kevinw/pyflakes-vim.git</h4>
</div>
<div id="outline-container-org5de13dd" class="outline-4">
<h4 id="org5de13dd">project.tar.gz</h4>
</div>
<div id="outline-container-org33d73ca" class="outline-4">
<h4 id="org33d73ca">minibufexplorerpp</h4>
</div>
<div id="outline-container-org2e05816" class="outline-4">
<h4 id="org2e05816">bufexplorer.zip</h4>
</div>
<div id="outline-container-orgb34b6ad" class="outline-4">
<h4 id="orgb34b6ad">Align.vim</h4>
</div>
<div id="outline-container-orgdc1ac9f" class="outline-4">
<h4 id="orgdc1ac9f">SQLUtilities</h4>
</div>
<div id="outline-container-orga940862" class="outline-4">
<h4 id="orga940862">matchit.zip</h4>
</div>
<div id="outline-container-org9e5f462" class="outline-4">
<h4 id="org9e5f462">xmledit</h4>
</div>
<div id="outline-container-org570e106" class="outline-4">
<h4 id="org570e106">on github</h4>
</div>
<div id="outline-container-org725214a" class="outline-4">
<h4 id="org725214a">tpope/vim-fugitive</h4>
</div>
<div id="outline-container-orgb93bb89" class="outline-4">
<h4 id="orgb93bb89">rstacruz/sparkup, {rtp: vim/}</h4>
</div>
<div id="outline-container-org5159f2c" class="outline-4">
<h4 id="org5159f2c">tpope/vim-rails.git</h4>
</div>
<div id="outline-container-org85515f7" class="outline-4">
<h4 id="org85515f7">repos</h4>
</div>
<div id="outline-container-org3589170" class="outline-4">
<h4 id="org3589170">git://git.wincent.com/command-t.git</h4>
</div>
</div>

    </div>
</section>


<footer id="footer">
    <br />
</footer>

  </body>
</html>
